<div style="text-align: center; background-color: #5A96E3; font-family: 'Trebuchet MS', Arial, sans-serif; color: white; padding: 20px; font-size: 40px; font-weight: bold; border-radius: 0 0 0 0; box-shadow: 0px 6px 8px rgba(0, 0, 0, 0.2);">
  Preprocess Data
</div>

In [148]:
import pandas as pd

## Read raw data that we have collected

In [149]:
annual_pop_df = pd.read_csv("../data/raw/OA.csv")
agri_employments_df = pd.read_csv("../data/raw/OEA.csv")
rural_employments_df = pd.read_csv("../data/raw/OER.csv")
values_df = pd.read_csv("../data/raw/QV.csv")
products_df = pd.read_csv("../data/raw/QCL.csv")

display(annual_pop_df.head(3))
display(agri_employments_df.head(3))
display(rural_employments_df.head(3))
display(values_df.head(3))
display(products_df.head(3))

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description,Note
0,OA,Annual population,237,Viet Nam,511,Total Population - Both sexes,3010,Population - Est. & Proj.,1950,1950,1000 No,25109.200,X,Figure from international organizations,NaN
1,OA,Annual population,237,Viet Nam,512,Total Population - Male,3010,Population - Est. & Proj.,1950,1950,1000 No,12408.031,X,Figure from international organizations,NaN
2,OA,Annual population,237,Viet Nam,513,Total Population - Female,3010,Population - Est. & Proj.,1950,1950,1000 No,12701.169,X,Figure from international organizations,NaN

,Domain Code,Domain,Area Code,Area,Indicator Code,Indicator,Sex Code,Sex,Year Code,Year,Element Code,Element,Source Code,Source,Unit,Value,Flag,Flag Description,Note
0,OEA,Employment Indicators: Agriculture,237,Viet Nam,21144,"Employment in agriculture, forestry and fishin...",1,Total,1991,1991,6199,Value,3043,ILO - ILO Modelled Estimates,1000 No,24059.27,X,Figure from international organizations,NaN
1,OEA,Employment Indicators: Agriculture,237,Viet Nam,21144,"Employment in agriculture, forestry and fishin...",1,Total,1992,1992,6199,Value,3043,ILO - ILO Modelled Estimates,1000 No,24384.94,X,Figure from international organizations,NaN
2,OEA,Employment Indicators: Agriculture,237,Viet Nam,21144,"Employment in agriculture, forestry and fishin...",1,Total,1993,1993,6199,Value,3043,ILO - ILO Modelled Estimates,1000 No,24641.43,X,Figure from international organizations,NaN

,Domain Code,Domain,Area Code,Area,Indicator Code,Indicator,Sex Code,Sex,Year Code,Year,Element Code,Element,Source Code,Source,Unit,Value,Flag,Flag Description,Note
0,OER,Employment Indicators: Rural,237,Viet Nam,21087,"Employment by age, total (15+), rural areas",1,Total,2007,2007,6199,Value,3023,Labour force survey,1000 No,34098.44,X,Figure from international organizations,Break in series: Methodology revised Repositor...
1,OER,Employment Indicators: Rural,237,Viet Nam,21087,"Employment by age, total (15+), rural areas",1,Total,2009,2009,6199,Value,3023,Labour force survey,1000 No,34615.17,X,Figure from international organizations,Repository: ILO-STATISTICS - Micro data proces...
2,OER,Employment Indicators: Rural,237,Viet Nam,21087,"Employment by age, total (15+), rural areas",1,Total,2010,2010,6199,Value,3023,Labour force survey,1000 No,35839.50,X,Figure from international organizations,Repository: ILO-STATISTICS - Micro data proces...

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description
0,QV,Value of Agricultural Production,237,Viet Nam,152,Gross Production Value (constant 2014-2016 tho...,711,"Anise, badian, coriander, cumin, caraway, fenn...",1961,1961,1000 Int. $,1521,E,Estimated value
1,QV,Value of Agricultural Production,237,Viet Nam,152,Gross Production Value (constant 2014-2016 tho...,711,"Anise, badian, coriander, cumin, caraway, fenn...",1962,1962,1000 Int. $,1521,E,Estimated value
2,QV,Value of Agricultural Production,237,Viet Nam,152,Gross Production Value (constant 2014-2016 tho...,711,"Anise, badian, coriander, cumin, caraway, fenn...",1963,1963,1000 Int. $,1521,E,Estimated value

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description,Note
0,QCL,Crops and livestock products,237,Viet Nam,5312,Area harvested,711,"Anise, badian, coriander, cumin, caraway, fenn...",1961,1961,ha,1000.0,E,Estimated value,NaN
1,QCL,Crops and livestock products,237,Viet Nam,5419,Yield,711,"Anise, badian, coriander, cumin, caraway, fenn...",1961,1961,100 g/ha,7000.0,E,Estimated value,NaN
2,QCL,Crops and livestock products,237,Viet Nam,5510,Production,711,"Anise, badian, coriander, cumin, caraway, fenn...",1961,1961,t,700.0,E,Estimated value,NaN

In [150]:
display(products_df[products_df['Element Code'] == 5513][products_df['Year'] == 1999].head())
display(products_df[products_df['Element Code'] == 5510][products_df['Year'] == 1999].head())

C:\Users\THINKPAD\AppData\Local\Temp\ipykernel_1920\2287051440.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  display(products_df[products_df['Element Code'] == 5513][products_df['Year'] == 1999].head())

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description,Note
4026,QCL,Crops and livestock products,237,Viet Nam,5513,Production,1062,"Hen eggs in shell, fresh",1999,1999,1000 No,3442863.0,A,Official figure,NaN

C:\Users\THINKPAD\AppData\Local\Temp\ipykernel_1920\2287051440.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  display(products_df[products_df['Element Code'] == 5510][products_df['Year'] == 1999].head())

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description,Note
116,QCL,Crops and livestock products,237,Viet Nam,5510,Production,711,"Anise, badian, coriander, cumin, caraway, fenn...",1999,1999,t,3001.99,I,Imputed value,NaN
313,QCL,Crops and livestock products,237,Viet Nam,5510,Production,486,Bananas,1999,1999,t,1288400.00,A,Official figure,NaN
496,QCL,Crops and livestock products,237,Viet Nam,5510,Production,176,"Beans, dry",1999,1999,t,144100.00,A,Official figure,NaN
601,QCL,Crops and livestock products,237,Viet Nam,5510,Production,51,"Beer of barley, malted",1999,1999,t,464000.00,A,Official figure,NaN
791,QCL,Crops and livestock products,237,Viet Nam,5510,Production,949,"Buffalo fat, unrendered",1999,1999,t,812.80,I,Imputed value,NaN

In [151]:
display(products_df[products_df['Element Code'] == 5112].head())
display(products_df[products_df['Element Code'] == 5113].head())
display(products_df[products_df['Element Code'] == 5114].head())

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description,Note
1886,QCL,Crops and livestock products,237,Viet Nam,5112,Stocks,1057,Chickens,1961,1961,1000 An,34700.0,X,Figure from international organizations,Unofficial figure
1887,QCL,Crops and livestock products,237,Viet Nam,5112,Stocks,1057,Chickens,1962,1962,1000 An,37100.0,X,Figure from international organizations,Unofficial figure
1888,QCL,Crops and livestock products,237,Viet Nam,5112,Stocks,1057,Chickens,1963,1963,1000 An,47300.0,X,Figure from international organizations,Unofficial figure
1889,QCL,Crops and livestock products,237,Viet Nam,5112,Stocks,1057,Chickens,1964,1964,1000 An,41100.0,X,Figure from international organizations,Unofficial figure
1890,QCL,Crops and livestock products,237,Viet Nam,5112,Stocks,1057,Chickens,1965,1965,1000 An,46000.0,X,Figure from international organizations,Unofficial figure

Empty DataFrame
Columns: [Domain Code, Domain, Area Code, Area, Element Code, Element, Item Code, Item, Year Code, Year, Unit, Value, Flag, Flag Description, Note]
Index: []

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Flag,Flag Description,Note
623,QCL,Crops and livestock products,237,Viet Nam,5114,Stocks,1181,Bees,1961,1961,No,15000.0,E,Estimated value,NaN
624,QCL,Crops and livestock products,237,Viet Nam,5114,Stocks,1181,Bees,1962,1962,No,20000.0,E,Estimated value,NaN
625,QCL,Crops and livestock products,237,Viet Nam,5114,Stocks,1181,Bees,1963,1963,No,25000.0,E,Estimated value,NaN
626,QCL,Crops and livestock products,237,Viet Nam,5114,Stocks,1181,Bees,1964,1964,No,30000.0,E,Estimated value,NaN
627,QCL,Crops and livestock products,237,Viet Nam,5114,Stocks,1181,Bees,1965,1965,No,36000.0,E,Estimated value,NaN

## Determine the features that have a large number of missing values

In [152]:
for df in [annual_pop_df, agri_employments_df, rural_employments_df, values_df, products_df]:
    percent_missing = df.isnull().sum() * 100 / len(df)
    missing_value_df = pd.DataFrame({'column_name': df.columns,
                                    'percent_missing': percent_missing})
    
    miss = (missing_value_df['column_name'][missing_value_df['percent_missing'].values >= 75]).values
    print(f"{df['Domain'].values[0]}, features with large missing value: {miss} (>= 75%)")

Annual population, features with large missing value: ['Note'] (>= 75%)
Employment Indicators: Agriculture, features with large missing value: [] (>= 75%)
Employment Indicators: Rural, features with large missing value: [] (>= 75%)
Value of Agricultural Production, features with large missing value: [] (>= 75%)
Crops and livestock products, features with large missing value: ['Note'] (>= 75%)

-   `annual_pop_df` and `products_df` have `Note` as the features that have a large number of missing values, but for now, we will keep it

## Check data type of each columns

In [153]:
for df in [annual_pop_df, agri_employments_df, rural_employments_df, values_df, products_df]:
    df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 655 entries, 0 to 654
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Domain Code       655 non-null    object
 1   Domain            655 non-null    object
 2   Area Code         655 non-null    int64
 3   Area              655 non-null    object
 4   Element Code      655 non-null    int64
 5   Element           655 non-null    object
 6   Item Code         655 non-null    int64
 7   Item              655 non-null    object
 8   Year Code         655 non-null    int64
 9   Year              655 non-null    int64
 10  Unit              655 non-null    object
 11  Value             655 non-null    float64
 12  Flag              655 non-null    object
 13  Flag Description  655 non-null    object
 14  Note              0 non-null      float64
dtypes: float64(2), int64(5), object(8)
memory usage: 76.9+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1096 entries, 0 to 1095
Data columns (total 19 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Domain Code       1096 non-null   object
 1   Domain            1096 non-null   object
 2   Area Code         1096 non-null   int64
 3   Area              1096 non-null   object
 4   Indicator Code    1096 non-null   int64
 5   Indicator         1096 non-null   object
 6   Sex Code          1096 non-null   int64
 7   Sex               1096 non-null   object
 8   Year Code         1096 non-null   int64
 9   Year              1096 non-null   int64
 10  Element Code      1096 non-null   int64
 11  Element           1096 non-null   object
 12  Source Code       1096 non-null   int64
 13  Source            1096 non-null   object
 14  Unit              1096 non-null   object
 15  Value             1096 non-null   float64
 16  Flag              1096 non-null   object
 17  Flag Description  1096 non-null   object
 18  Note              1043 non-null   object
dtypes: float64(1), int64(7), object(11)
memory usage: 162.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 936 entries, 0 to 935
Data columns (total 19 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Domain Code       936 non-null    object
 1   Domain            936 non-null    object
 2   Area Code         936 non-null    int64
 3   Area              936 non-null    object
 4   Indicator Code    936 non-null    int64
 5   Indicator         936 non-null    object
 6   Sex Code          936 non-null    int64
 7   Sex               936 non-null    object
 8   Year Code         936 non-null    int64
 9   Year              936 non-null    int64
 10  Element Code      936 non-null    int64
 11  Element           936 non-null    object
 12  Source Code       936 non-null    int64
 13  Source            936 non-null    object
 14  Unit              936 non-null    object
 15  Value             936 non-null    float64
 16  Flag              936 non-null    object
 17  Flag Description  936 non-null    object
 18  Note              936 non-null    object
dtypes: float64(1), int64(7), object(11)
memory usage: 139.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13785 entries, 0 to 13784
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Domain Code       13785 non-null  object
 1   Domain            13785 non-null  object
 2   Area Code         13785 non-null  int64
 3   Area              13785 non-null  object
 4   Element Code      13785 non-null  int64
 5   Element           13785 non-null  object
 6   Item Code         13785 non-null  int64
 7   Item              13785 non-null  object
 8   Year Code         13785 non-null  int64
 9   Year              13785 non-null  int64
 10  Unit              13785 non-null  object
 11  Value             13785 non-null  int64
 12  Flag              13785 non-null  object
 13  Flag Description  13785 non-null  object
dtypes: int64(6), object(8)
memory usage: 1.5+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15070 entries, 0 to 15069
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Domain Code       15070 non-null  object
 1   Domain            15070 non-null  object
 2   Area Code         15070 non-null  int64
 3   Area              15070 non-null  object
 4   Element Code      15070 non-null  int64
 5   Element           15070 non-null  object
 6   Item Code         15070 non-null  int64
 7   Item              15070 non-null  object
 8   Year Code         15070 non-null  int64
 9   Year              15070 non-null  int64
 10  Unit              15070 non-null  object
 11  Value             15070 non-null  float64
 12  Flag              15070 non-null  object
 13  Flag Description  15070 non-null  object
 14  Note              548 non-null    object
dtypes: float64(1), int64(5), object(9)
memory usage: 1.7+ MB

-   For all of the above dataframe: `Area Code`, `Element Code`, `Item Code`, `Year` , `Indicator Code` have numeric type. However, their magnitude does not have a significance. And, `Year` actually represents a period instead of a number, `Area Code`, `Element Code`, `Item Code`, `Indicator Code` are just a category. Thus, they can be convert to categorical type.

In [154]:
for col in annual_pop_df.drop(columns= 'Value').columns:
    annual_pop_df[col] = annual_pop_df[col].astype(str)

for col in agri_employments_df.drop(columns= 'Value').columns:
    agri_employments_df[col] = agri_employments_df[col].astype(str)

for col in rural_employments_df.drop(columns= 'Value').columns:
    rural_employments_df[col] = rural_employments_df[col].astype(str)

for col in values_df.drop(columns= 'Value').columns:
    values_df[col] = values_df[col].astype(str)

for col in products_df.drop(columns= 'Value').columns:
    products_df[col] = products_df[col].astype(str)

-   Let check one last time

In [155]:
for df in [annual_pop_df, agri_employments_df, rural_employments_df, values_df, products_df]:
    df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 655 entries, 0 to 654
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Domain Code       655 non-null    object
 1   Domain            655 non-null    object
 2   Area Code         655 non-null    object
 3   Area              655 non-null    object
 4   Element Code      655 non-null    object
 5   Element           655 non-null    object
 6   Item Code         655 non-null    object
 7   Item              655 non-null    object
 8   Year Code         655 non-null    object
 9   Year              655 non-null    object
 10  Unit              655 non-null    object
 11  Value             655 non-null    float64
 12  Flag              655 non-null    object
 13  Flag Description  655 non-null    object
 14  Note              655 non-null    object
dtypes: float64(1), object(14)
memory usage: 76.9+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1096 entries, 0 to 1095
Data columns (total 19 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Domain Code       1096 non-null   object
 1   Domain            1096 non-null   object
 2   Area Code         1096 non-null   object
 3   Area              1096 non-null   object
 4   Indicator Code    1096 non-null   object
 5   Indicator         1096 non-null   object
 6   Sex Code          1096 non-null   object
 7   Sex               1096 non-null   object
 8   Year Code         1096 non-null   object
 9   Year              1096 non-null   object
 10  Element Code      1096 non-null   object
 11  Element           1096 non-null   object
 12  Source Code       1096 non-null   object
 13  Source            1096 non-null   object
 14  Unit              1096 non-null   object
 15  Value             1096 non-null   float64
 16  Flag              1096 non-null   object
 17  Flag Description  1096 non-null   object
 18  Note              1096 non-null   object
dtypes: float64(1), object(18)
memory usage: 162.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 936 entries, 0 to 935
Data columns (total 19 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Domain Code       936 non-null    object
 1   Domain            936 non-null    object
 2   Area Code         936 non-null    object
 3   Area              936 non-null    object
 4   Indicator Code    936 non-null    object
 5   Indicator         936 non-null    object
 6   Sex Code          936 non-null    object
 7   Sex               936 non-null    object
 8   Year Code         936 non-null    object
 9   Year              936 non-null    object
 10  Element Code      936 non-null    object
 11  Element           936 non-null    object
 12  Source Code       936 non-null    object
 13  Source            936 non-null    object
 14  Unit              936 non-null    object
 15  Value             936 non-null    float64
 16  Flag              936 non-null    object
 17  Flag Description  936 non-null    object
 18  Note              936 non-null    object
dtypes: float64(1), object(18)
memory usage: 139.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13785 entries, 0 to 13784
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Domain Code       13785 non-null  object
 1   Domain            13785 non-null  object
 2   Area Code         13785 non-null  object
 3   Area              13785 non-null  object
 4   Element Code      13785 non-null  object
 5   Element           13785 non-null  object
 6   Item Code         13785 non-null  object
 7   Item              13785 non-null  object
 8   Year Code         13785 non-null  object
 9   Year              13785 non-null  object
 10  Unit              13785 non-null  object
 11  Value             13785 non-null  int64
 12  Flag              13785 non-null  object
 13  Flag Description  13785 non-null  object
dtypes: int64(1), object(13)
memory usage: 1.5+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15070 entries, 0 to 15069
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Domain Code       15070 non-null  object
 1   Domain            15070 non-null  object
 2   Area Code         15070 non-null  object
 3   Area              15070 non-null  object
 4   Element Code      15070 non-null  object
 5   Element           15070 non-null  object
 6   Item Code         15070 non-null  object
 7   Item              15070 non-null  object
 8   Year Code         15070 non-null  object
 9   Year              15070 non-null  object
 10  Unit              15070 non-null  object
 11  Value             15070 non-null  float64
 12  Flag              15070 non-null  object
 13  Flag Description  15070 non-null  object
 14  Note              15070 non-null  object
dtypes: float64(1), object(14)
memory usage: 1.7+ MB

## Clear duplicates columns:
-   There is `Domain Code` and `Domain` columns, they have the same meaning, we will create a new dataframe to store it.
-   There is `Area Code` and `Area` columns, they have the same meaning, we will create a new dataframe to store it.
-   There is `Element Code` and `Element` columns, they have the same meaning, we will create a new dataframe to store it.
-   There is `Indicator Code` and `Indicator` columns, they have the same meaning, we will create a new dataframe to store it.
-   There is `Item Code` and `Item` columns, they have the same meaning, we will create a new dataframe to store it.
-   There is `Year Code` and `Year` columns, they have the same values, so we drop the `Year Code`.
-   There is `Source Code` and `Source` columns, they have the same meaning, we will create a new dataframe to store it.
-   There is `Flag` and `Flag Description` columns, they have the same meaning, we will create a new dataframe to store it.

- Domain Code:

In [156]:
domain = []
domain_code = []
for df in [annual_pop_df, agri_employments_df, rural_employments_df, values_df, products_df]:
    codes = df['Domain Code'].unique()
    for c in codes:
        dom = df['Domain'][df['Domain Code'] == c].unique()[0]
        if c not in domain_code:
            domain_code.append(c)
        if dom not in domain:
            domain.append(dom)


domain_df = pd.DataFrame(list(zip(domain_code, domain)), columns= ['Domain Code', 'Domain'])
domain_df.to_csv("../data/external/domain_code.csv", index= False)
domain_df.head()

  Domain Code                              Domain
0          OA                   Annual population
1         OEA  Employment Indicators: Agriculture
2         OER        Employment Indicators: Rural
3          QV    Value of Agricultural Production
4         QCL        Crops and livestock products

-   Area Code

In [157]:
area = []
area_code = []
for df in [annual_pop_df, agri_employments_df, rural_employments_df, values_df, products_df]:
    codes = df['Area Code'].unique()
    for c in codes: 
        are = df['Area'][df['Area Code'] == c].unique()[0]
        if c not in area_code:
            area_code.append(c)
        if are not in area:
            area.append(are)


area_df = pd.DataFrame(list(zip(area_code, area)), columns= ['Area Code', 'Area'])
area_df.to_csv("../data/external/area_code.csv", index= False)
area_df.head()

  Area Code      Area
0       237  Viet Nam

-   Element Code

In [158]:
element = []
element_code = []
for df in [annual_pop_df, values_df, products_df]:
    codes = df['Element Code'].unique()
    for c in codes: 
        ele = df['Element'][df['Element Code'] == c].unique()[0]
        if c not in element_code:
            element_code.append(c)
        if are not in element:
            element.append(ele + f" ({(df[df['Element Code'] == c]['Unit'].unique()[0])})")


element_df = pd.DataFrame(list(zip(element_code, element)), columns= ['Element Code', 'Element'])
element_df.to_csv("../data/external/element_code.csv", index= False)
element_df.head()

  Element Code                                  Element
0          511  Total Population - Both sexes( 1000 No)
1          512        Total Population - Male( 1000 No)
2          513      Total Population - Female( 1000 No)
3          551               Rural population( 1000 No)
4          561               Urban population( 1000 No)

-   Indicator Code

In [159]:
indicator = []
indicator_code = []
for df in [agri_employments_df, rural_employments_df]:
    codes = df['Indicator Code'].unique()
    for c in codes: 
        ind = df['Indicator'][df['Indicator Code'] == c].unique()[0]
        if c not in indicator_code:
            indicator_code.append(c)
        if are not in indicator:
            indicator.append(ind)


indicator_df = pd.DataFrame(list(zip(indicator_code, indicator)), columns= ['Indicator Code', 'Indicator'])
indicator_df.to_csv("../data/external/indicator_code.csv", index= False)
indicator_df.head()

  Indicator Code                                          Indicator
0          21144  Employment in agriculture, forestry and fishin...
1          21085  Agriculture value added per worker (constant 2...
2          21156  Share of employment in agriculture, forestry a...
3          21066  Employment in agriculture, forestry and fishin...
4          21088  Employment in agriculture, forestry and fishin...

-   Item Code

In [160]:
item = []
item_code = []
for df in [annual_pop_df, values_df, products_df]:
    codes = df['Item Code'].unique()
    for c in codes: 
        ite = df['Item'][df['Item Code'] == c].unique()[0]
        if c not in item_code:
            item_code.append(c)
        if are not in item:
            item.append(ite)


item_df = pd.DataFrame(list(zip(item_code, item)), columns= ['Item Code', 'Item'])
item_df.to_csv("../data/external/item_code.csv", index= False)
item_df.head()

  Item Code                                               Item
0      3010                          Population - Est. & Proj.
1       711  Anise, badian, coriander, cumin, caraway, fenn...
2       572                                           Avocados
3       486                                            Bananas
4       176                                         Beans, dry

- Year Code

In [161]:
annual_pop_df = annual_pop_df.drop(columns='Year Code')
agri_employments_df = agri_employments_df.drop(columns='Year Code')
rural_employments_df = rural_employments_df.drop(columns='Year Code')
values_df = values_df.drop(columns='Year Code')
products_df = products_df.drop(columns='Year Code')

-   Source Code

In [162]:
source = []
source_code = []
for df in [agri_employments_df, rural_employments_df]:
    codes = df['Source Code'].unique()
    for c in codes: 
        ind = df['Source'][df['Source Code'] == c].unique()[0]
        if c not in source_code:
            source_code.append(c)
        if are not in source:
            source.append(ind)


source_df = pd.DataFrame(list(zip(source_code, source)), columns= ['Source Code', 'Source'])
source_df.to_csv("../data/external/source_code.csv", index= False)
source_df.head()

  Source Code                        Source
0        3043  ILO - ILO Modelled Estimates
1        3023           Labour force survey

-   Flag Description

In [163]:
flag = []
flag_des = []
for df in [annual_pop_df, agri_employments_df, rural_employments_df, values_df, products_df]:
    flags = df['Flag'].unique()
    for f in flags:
        des = df['Flag Description'][df['Flag'] == f].unique()[0]
        if f not in flag:
            flag.append(f)
        if des not in flag_des:
            flag_des.append(des)

flag_df = pd.DataFrame(list(zip(flag, flag_des)), columns= ['Flag', 'Flag Description'])
flag_df.to_csv("../data/external/flag_des.csv", index= False)
flag_df.head()

  Flag                                   Flag Description
0    X            Figure from international organizations
1    E                                    Estimated value
2    I                                      Imputed value
3    M  Missing value (data cannot exist, not applicable)
4    A                                    Official figure

-   Now we drop all duplicate columns

In [164]:
annual_pop_df = annual_pop_df.drop(columns=['Flag Description', 'Area', 'Domain', 'Item', 'Element'])
agri_employments_df = agri_employments_df.drop(columns=['Flag Description', 'Area', 'Domain', 'Source', 'Indicator'])
rural_employments_df = rural_employments_df.drop(columns=['Flag Description', 'Area Code', 'Domain', 'Source', 'Indicator'])
values_df = values_df.drop(columns=['Flag Description', 'Area', 'Domain', 'Item', 'Element'])
products_df = products_df.drop(columns=['Flag Description', 'Area', 'Domain', 'Item', 'Element'])

display(annual_pop_df.head(3))
display(agri_employments_df.head(3))
display(rural_employments_df.head(3))
display(values_df.head(3))
display(products_df.head(3))

,Domain Code,Area Code,Element Code,Item Code,Year,Unit,Value,Flag,Note
0,OA,237,511,3010,1950,1000 No,25109.200,X,nan
1,OA,237,512,3010,1950,1000 No,12408.031,X,nan
2,OA,237,513,3010,1950,1000 No,12701.169,X,nan

,Domain Code,Area Code,Indicator Code,Sex Code,Sex,Year,Element Code,Element,Source Code,Unit,Value,Flag,Note
0,OEA,237,21144,1,Total,1991,6199,Value,3043,1000 No,24059.27,X,nan
1,OEA,237,21144,1,Total,1992,6199,Value,3043,1000 No,24384.94,X,nan
2,OEA,237,21144,1,Total,1993,6199,Value,3043,1000 No,24641.43,X,nan

,Domain Code,Area,Indicator Code,Sex Code,Sex,Year,Element Code,Element,Source Code,Unit,Value,Flag,Note
0,OER,Viet Nam,21087,1,Total,2007,6199,Value,3023,1000 No,34098.44,X,Break in series: Methodology revised Repositor...
1,OER,Viet Nam,21087,1,Total,2009,6199,Value,3023,1000 No,34615.17,X,Repository: ILO-STATISTICS - Micro data proces...
2,OER,Viet Nam,21087,1,Total,2010,6199,Value,3023,1000 No,35839.50,X,Repository: ILO-STATISTICS - Micro data proces...

  Domain Code Area Code Element Code Item Code  Year         Unit  Value Flag
0          QV       237          152       711  1961  1000 Int. $   1521    E
1          QV       237          152       711  1962  1000 Int. $   1521    E
2          QV       237          152       711  1963  1000 Int. $   1521    E

,Domain Code,Area Code,Element Code,Item Code,Year,Unit,Value,Flag,Note
0,QCL,237,5312,711,1961,ha,1000.0,E,nan
1,QCL,237,5419,711,1961,100 g/ha,7000.0,E,nan
2,QCL,237,5510,711,1961,t,700.0,E,nan

## Check for duplicate rows

In [165]:
for df in [annual_pop_df, agri_employments_df, rural_employments_df, values_df, products_df]:
    index = agri_employments_df.index
    detectDupSeries = index.duplicated(keep='first')
    num_duplicated_rows = detectDupSeries.sum()
    if num_duplicated_rows == 0:
        print(f"{df['Domain Code'].values[0]} have no duplicated line.!")
    else:
        if num_duplicated_rows > 1:
            ext = "lines"
        else:
            ext = "line"
        print(f"{df['Domain Code'].values[0]} {num_duplicated_rows} duplicated " + ext + ". Please de-deduplicate your raw data.!")

OA have no duplicated line.!
OEA have no duplicated line.!
OER have no duplicated line.!
QV have no duplicated line.!
QCL have no duplicated line.!

### Save processed data to a new csv file

In [166]:
annual_pop_df.to_csv("../data/processed/preprocess_OA.csv", index= False)
agri_employments_df.to_csv("../data/processed/preprocess_OEA.csv", index= False)
rural_employments_df.to_csv("../data/processed/preprocess_OER.csv", index= False)
values_df.to_csv("../data/processed/preprocess_QV.csv", index= False)
products_df.to_csv("../data/processed/preprocess_QCL.csv", index= False)